snlkuharlocal/src/InformationRegisters/ФР_ОбъектыКВыгрузке/ФР_ОбъектыКВыгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФР_ОбъектыКВыгрузке</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборРС</name>
    <comment>Отбор регистра сведений</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПриВыгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСсылкаУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтборРС_Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД_Пакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СкидкиНоменклатуры/СкидкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийПС/КодыОперацийПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийПС</name>
  <comment>Коды операций с подарочными сертификатами</comment>
  <enumValues>
    <name>Инициализаиця</name>
  </enumValues>
  <enumValues>
    <name>Дарение</name>
  </enumValues>
  <enumValues>
    <name>Активация</name>
  </enumValues>
  <enumValues>
    <name>Деактивация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/ФР_ОбъектыКВыгрузке/ManagerModule.bsl
Функция ПолучитьРеквизитСправочникаИзРегистра(СпрСсылка,ИмяРеквизита)
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ 
	|	ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников	
	|ГДЕ
	|	Справочник		= &СпрСсылка
	|	И ИмяРеквизита  = &ИмяРеквизита
	|";	
	
	Запрос.УстановитьПараметр("СпрСсылка",		СпрСсылка);
	Запрос.УстановитьПараметр("ИмяРеквизита",	ИмяРеквизита);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗначениеРеквизита) Тогда
		Результат=Выборка.ЗначениеРеквизита;
	Иначе
		Результат=Неопределено;	
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //ПолучитьРеквизитСправочникаИзРегистра(СпрСсылка,ИмяРеквизита)
 
Функция СериализоватьВXML(Значение)
	ЗаписьXML	= Новый ЗаписьXML();
	
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML,Значение,НазначениеТипаXML.Неявное);
		
	Строка	= ЗаписьXML.Закрыть();
	
	Возврат Строка;
КонецФункции //СериализоватьВXML(Значение)
 
Функция ОпределитьУзелПолучатель()
	//СДЕЛАТЬ 
	//реализовать нормальную процедуру для периферийной и центральной базы
	//А может и не надо.......если все в центр сыпется ......подумать.......
	
	Возврат ФР_ОбщегоНазначения_ПИ.УзелПолучательФранчБаза();
КонецФункции // ()

Функция ДобавитьОшибки(Результат1,Результат2)
	Для Каждого ТекстОшибки Из Результат2.Ошибки Цикл
		Результат1.Ошибки.Добавить(ТекстОшибки);	
	КонецЦикла;
КонецФункции //ДобавитьОшибки(Результат1,Результат2)

Функция ЗарегистрироватьОбъект(Знач СсылкаНаОбъект,	Отправитель=Неопределено, ДопПараментры=Неопределено) Экспорт	
	Результат			= Новый Структура("Результат,Ошибки",Ложь,Новый Массив);
	
	ТипОбъекта			= ТипЗнч(СсылкаНаОбъект);
	ДанныеРегистрации	= НужноРегистрироватьОбъект(СсылкаНаОбъект,ТипОбъекта,Отправитель);
	
	Если ДанныеРегистрации.Нужно =  Ложь Тогда
		ДобавитьОшибки(Результат,ДанныеРегистрации);
		Возврат Результат;	
	КонецЕсли; 
	
	//Функция СделатьЗаписьРегистрации(ОбъектСсылка,ВариантВыгрузки="",ОтборРС="",ПодразделениеПолучатель=Неопределено)
	ОтборРС					= "";
	ПодразделениеПолучатель	= Неопределено;
	
	Если ФР_ОбщегоНазначения_ПИ.ЭтоНаборЗаписейРС(ЗначениеВСтрокуВнутр(ТипОбъекта)) Тогда
		ОтборРС		= ЗначениеВСтрокуВнутр(СсылкаНаОбъект.Отбор);
	ИначеЕсли ТипОбъекта	= Тип("СправочникСсылка.Номенклатура") Тогда
		//+HELP-8160 20251211 Михайловский
		Род1 = СсылкаНаОбъект.Родитель;
		Род2 = СсылкаНаОбъект.Родитель.Родитель;
		Если  ЗначениеЗаполнено(Род1) Тогда
			ДанныеРегистрации1	= НужноРегистрироватьОбъект(Род1, ТипОбъекта, Отправитель);
			Р1 = СделатьЗаписьРегистрации(Род1, ДанныеРегистрации1.ВариантВыгрузки, ОтборРС, ПодразделениеПолучатель);
		КонецЕсли;
		Если  ЗначениеЗаполнено(Род2) Тогда
			ДанныеРегистрации2	= НужноРегистрироватьОбъект(Род2, ТипОбъекта, Отправитель);
			Р2 = СделатьЗаписьРегистрации(Род2, ДанныеРегистрации2.ВариантВыгрузки, ОтборРС, ПодразделениеПолучатель);
		КонецЕсли;
		//-HELP-8160 20251211 Михайловский	
	Иначе
		ПодразделениеПолучатель	= ДанныеРегистрации.ПодразделениеПолучатель;
	КонецЕсли;
	
	РезультатРегистрации	= СделатьЗаписьРегистрации(ДанныеРегистрации.ВыгружаемаяСсылка,ДанныеРегистрации.ВариантВыгрузки,ОтборРС,ПодразделениеПолучатель);		
	Если РезультатРегистрации.Результат Тогда
		Результат.Результат	= Истина;
	Иначе				
		ДобавитьОшибки(Результат,РезультатРегистрации);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗарегистрироватьОбъект(Знач СсылкаНаОбъект) Экспорт

Функция ДанныеПодразделенияДокумента(ДокСсылка,ПолноеИмяТипа=Неопределено)
	Результат	= Новый Структура("Подразделение,ВидПодразделения,ДатаПереходаНаНовуюВерсию,ДатаДокумента",Справочники.Подразделения.ПустаяСсылка(),Перечисления.ВидыПодразделений.ПустаяСсылка());
	Если ФР_ОбщегоНазначения_ПИ.ЕстьРеквизитДокумента_("Подразделение",ПолноеИмяТипа) Тогда		
		Поля	= ПолучитьРеквизитыШапки(ДокСсылка,"Дата,Подразделение,Подразделение.ВидПодразделения","Документ");
		
		Результат.Подразделение		= Поля.Подразделение;	
		Результат.ВидПодразделения	= Поля.Подразделение_ВидПодразделения;
		Результат.ДатаДокумента		= Поля.Дата;
		
	ИначеЕсли ФР_ОбщегоНазначения_ПИ.ЕстьРеквизитДокумента_("Склад",ПолноеИмяТипа) Тогда
		Поля 	= ПолучитьРеквизитыШапки(ДокСсылка,"Дата,Склад.Подразделение,Склад.Подразделение.ВидПодразделения","Документ");				
		
		Результат.Подразделение		= Поля.Склад_Подразделение;	
		Результат.ВидПодразделения	= Поля.Склад_Подразделение_ВидПодразделения;
		Результат.ДатаДокумента		= Поля.Дата;
	Иначе
		Поля						= ПолучитьРеквизитыШапки(ДокСсылка,"Дата");
		Результат.ДатаДокумента		= Поля.Дата;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ()
 

Функция НужноРегистрироватьОбъект(Знач СсылкаНаОбъект, ТипОбъекта = Неопределено, Отправитель = Неопределено) Экспорт
	Результат	= Новый Структура("ВариантВыгрузки,ВыгружаемаяСсылка,ПодразделениеПолучатель,Нужно,Ошибки",
		"",СсылкаНаОбъект,Неопределено,Ложь,Новый Массив);	
		
	Если СсылкаНаОбъект=Неопределено Тогда 
		Результат.Ошибки.Добавить("Неопределенный объект !");
		Возврат Результат; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отправитель) И ТипЗнч(Отправитель)=ТипЗнч(ПланыОбмена.ФР_ОбменСФРК.ПустаяСсылка()) Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	Если ТипОбъекта=Неопределено Тогда
		ТипОбъекта=ТипЗнч(СсылкаНаОбъект);	
	КонецЕсли;	
	
	ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипОбъекта));	
	
	Если ОТ.КлассЕЧ="РегистрСведений" И ЗначениеЗаполнено(СсылкаНаОбъект.Отбор)  Тогда
	ИначеЕсли НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Результат;		
	КонецЕсли;	
	
	ИмяПланаОбмена			= "ФР_ОбменСФРК";	
	
	Если ОТ.КлассЕЧ="Документ" Тогда	
		Если ТипОбъекта=Тип("ДокументСсылка.Заказ") Тогда
			текРезультат		= Это_ЗПК_На_ФР(СсылкаНаОбъект);			
			Если текРезультат.Результат Тогда
				Результат.ВариантВыгрузки			= "ЗПК_ЗПС";		
				
				Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
				Результат.Нужно						= Истина;
			Иначе
				Результат.Ошибки.Добавить("Это не ЗПК на ФР.");
			КонецЕсли;			
		ИначеЕсли ТипОбъекта=Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			текРезультат		= Это_РНК_На_ФР(СсылкаНаОбъект);
			Если текРезультат.Результат Тогда
				Результат.ВариантВыгрузки			= "РНК_ПНК";		
				
				Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
				
				НакладнаяГОилиО	 = НакладнаяГотоваКОтгрузкеИлиОтгружена(СсылкаНаОбъект);
				
				Если НакладнаяГОилиО Тогда
					Результат.Нужно	= Истина;				
				КонецЕсли;				
			Иначе
				Результат.Ошибки.Добавить("Это не РНК на ФР.");
			КонецЕсли;			
		ИначеЕсли ТипОбъекта=Тип("ДокументСсылка.Перемещение") Тогда
			НакладнаяГОилиО	 = НакладнаяГотоваКОтгрузкеИлиОтгружена(СсылкаНаОбъект);
			
			//Грузим РНК
			Если НакладнаяГОилиО Тогда
				текРезультат	= Это_ПРМ_ПНК_На_ФР(СсылкаНаОбъект);
				Если текРезультат.Результат Тогда
					Результат.ВариантВыгрузки			= "ПРМ_ПНК";
					Результат.Нужно			  			= Истина;
					Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;	
				Иначе
					текРезультат	= Это_ПРМ_РНК_С_ФР(СсылкаНаОбъект);
					Если текРезультат.Результат Тогда
						Результат.ВариантВыгрузки			= "ПРМ_РНК";
						Результат.Нужно			  			= Истина;				
						Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
					Иначе
						текРезультат	= Это_ПРМ_ПРМ_На_ФР(СсылкаНаОбъект);
						Если текРезультат.Результат Тогда
							Результат.ВариантВыгрузки			= "ПРМ_ПРМ";
							Результат.Нужно			  			= Истина;				
							
							Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
						Иначе
							текРезультат	= Это_ПРМ_ПРМ_С_ФР(СсылкаНаОбъект);
							//+HELP-1380 20241015 Михайловский
							Если текРезультат.Результат Тогда
							//-HELP-1380 20241015 Михайловский
								Результат.ВариантВыгрузки			= "ПРМ_ПРМ";
								Результат.Нужно			  			= Истина;				
								Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
							//+HELP-1380 20241015 Михайловский
							КонецЕсли;
							//-HELP-1380 20241015 Михайловский							
						КонецЕсли;					
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипОбъекта=Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
			текРезультат		= Это_РКМ_На_ФР(СсылкаНаОбъект);
			Если текРезультат.Результат Тогда
				Если ЗначениеЗаполнено(текРезультат.ДокОснование) 
					И ТипЗнч(текРезультат.ДокОснование) = Тип("ДокументСсылка.Перемещение")
					И текРезультат.ВидРекламации = Перечисления.ВидыРекламаций.Рекламация Тогда
					//Это какой то трешовый мусор (но очень нужный для работы) - его типа выгружать не надо
					Результат.Нужно	= Ложь;
				Иначе
					Результат.ВариантВыгрузки			= "РКМ_КП";		
				
					Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
				
					//Результат.Нужно	= текРезультат.Проведен;
					//Малахов 10.01.24 иначе не выгружается пометка удаления
					Результат.Нужно=Истина;
					//Малахов 10.01.24
				КонецЕсли;				
			Иначе
				Результат.Ошибки.Добавить("Это не РНК на ФР.");
			КонецЕсли;			
		ИначеЕсли ТипОбъекта=Тип("ДокументСсылка.ЭмиссияПодарочныхСертификатов") Тогда
			РеквизитыШ = ПолучитьРеквизитыШапки(СсылкаНаОбъект,"КодОперации,Подразделение","Документ");
			Если 
				РеквизитыШ.КодОперации = Перечисления.КодыОперацийПС.Деактивация
				ИЛИ РеквизитыШ.КодОперации = Перечисления.КодыОперацийПС.Дарение Тогда
				
				Результат.ВариантВыгрузки			= "ЭПС_СПН";
				Результат.Нужно			  			= Истина;				
						
				Результат.ПодразделениеПолучатель	= РеквизитыШ.Подразделение;				
			КонецЕсли;			
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ЗаявкаНаРекламацию") Тогда
			РеквизитыШ = ПолучитьРеквизитыШапки(СсылкаНаОбъект,"Отработано","Документ");
			Если РеквизитыШ.Отработано Тогда
				Результат.Нужно = Истина;
			КонецЕсли;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
			Результат = НужноРегистрироватьХКМ_ДляФР(СсылкаНаОбъект);
		//+HELP-2306 20250220 Михайловский	
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ЗаявкаНаПостСторонАссорт") Тогда
			Результат = НужноРегистрироватьПСАЗ(СсылкаНаОбъект);	
		//-HELP-2306 20250220 Михайловский
		Иначе
			ДанныеПодразделения		= ДанныеПодразделенияДокумента(СсылкаНаОбъект,ОТ.ПолноеИмя);
			Результат.ПодразделениеПолучатель	= ДанныеПодразделения.Подразделение;			
			
			Если ДанныеПодразделения.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
				ИЛИ ДанныеПодразделения.ВидПодразделения=Перечисления.ВидыПодразделений.Торговое Тогда
				Если ФР_ОбщегоНазначения_ПИ.ОбъектХодитСверхуВниз(ИмяПланаОбмена,ОТ.ПолноеИмя) Тогда
					Результат.Нужно	= Истина;
				ИначеЕсли ФР_ОбщегоНазначения_ПИ.ОбъектХодитТудаСюда(ИмяПланаОбмена,ОТ.ПолноеИмя) Тогда
					Результат.Нужно	= НЕ ЗначениеЗаполнено(Отправитель);					
				ИначеЕсли ФР_ОбщегоНазначения_ПИ.ОбъектХодитСверхуВнизДляСтарыхУзлов(ИмяПланаОбмена,ОТ.ПолноеИмя) Тогда
					Результат.Нужно = Ложь; //Чирков 13.09.2024 - все - нет больше старых узлов
					//ДатаПерехода	= ПолучитьРеквизитСправочникаИзРегистра(Результат.ПодразделениеПолучатель,"ДатаПереходаНаНовуюВерсию");					
					//Если НЕ ЗначениеЗаполнено(ДатаПерехода) Тогда					
					//	Результат.Нужно	= Истина						
					//Иначе
					//	Результат.Нужно	= (ДанныеПодразделения.ДатаДокумента<НачалоДня(ДатаПерехода));
					//КонецЕсли;
					//Если НЕ Результат.Нужно Тогда
					//	Результат.Ошибки.Добавить("Объект не ходит сверху вниз после перехода на новую версию.");					
					//КонецЕсли;					
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеПодразделения.Подразделение) Тогда
				Если ФР_ОбщегоНазначения_ПИ.ОбъектХодитСверхуВниз(ИмяПланаОбмена,ОТ.ПолноеИмя) Тогда
					Если ТипОбъекта = Тип("ДокументСсылка.ПрайсЛист") Тогда
						РеквизитыШ = ПолучитьРеквизитыШапки(СсылкаНаОбъект,"ТипЦен.Закупочный_ФР,ТипЦен.Розничный","Документ");																		
						Если РеквизитыШ.ТипЦен_Закупочный_ФР = Истина 
							ИЛИ РеквизитыШ.ТипЦен_Розничный = Истина Тогда						
							Результат.Нужно	= Истина;						
						КонецЕсли; 
					Иначе
						Результат.Нужно	= Истина;
					КонецЕсли; 					
				Иначе
					Результат.Ошибки.Добавить("Объект не ходит сверху вниз.");					
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ОТ.КлассЕЧ="Справочник" Тогда		
		Если ЗначениеЗаполнено(Отправитель) И ТипЗнч(Отправитель)=Тип("ПланОбменаСсылка.ФР_ОбменСФРК") Тогда
			Возврат Результат;
		КонецЕсли;
		
		Если ОТ.Вид	="Номенклатура" Тогда
			Реквизиты = ПолучитьРеквизитыШапки(СсылкаНаОбъект,"ЭтоГруппа,Родитель");
			
			Если Реквизиты.ЭтоГруппа = Null  ИЛИ Реквизиты.ЭтоГруппа = Неопределено Тогда
				Результат.Нужно	= Ложь;
				Возврат Результат;			
			КонецЕсли; 
			
			Если Реквизиты.ЭтоГруппа Тогда
				Результат.ВариантВыгрузки	= ВариантВыгрузкиГруппаНоменклатуры(СсылкаНаОбъект);
				Если Результат.ВариантВыгрузки<>-1 Тогда				
					Результат.Нужно				= Истина;
				КонецЕсли;				
			Иначе				
				Если НЕ ЭтоМодель(Реквизиты.Родитель) Тогда
					ЗарегистрироватьОбъект(Реквизиты.Родитель);
				КонецЕсли;
				Результат.ВариантВыгрузки	= "Справочник.ХарактеристикиНоменклатуры"; //Характеристика					
				Результат.Нужно				= Истина;				
			КонецЕсли;
		ИначеЕсли ОТ.Вид = "Пользователи" Тогда
			Подразделение	= ПодразделениеСправочника(СсылкаНаОбъект);			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				времРеквизиты	= ПолучитьРеквизитыШапки(Подразделение,"ЭтоГруппа,Код,ВидПодразделения","Справочник");
				Если НЕ ВремРеквизиты.ЭтоГруппа
					И (ВремРеквизиты.Код="SSP-0001" 
						ИЛИ времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
						ИЛИ времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Торговое
						) Тогда
					Результат.ВариантВыгрузки			= "Элемент";
					Результат.ПодразделениеПолучатель   = Подразделение;
					Результат.Нужно						= Истина;
				КонецЕсли;
			КонецЕсли; 
		ИначеЕсли ОТ.Вид = "Склады" Тогда
			Подразделение	= ПодразделениеСправочника(СсылкаНаОбъект);			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				времРеквизиты	= ПолучитьРеквизитыШапки(Подразделение,"ЭтоГруппа,Код,ВидПодразделения","Справочник");
				Если НЕ ВремРеквизиты.ЭтоГруппа				
					// Кухарь А.Ю.  18.10.2023 начало
					// И времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
					И (времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг 
					или времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Торговое) 
					Тогда					 
					// Кухарь А.Ю.  18.10.2023 конец
					
					Результат.ВариантВыгрузки			= "Элемент";
					Результат.ПодразделениеПолучатель   = Подразделение;
					Результат.Нужно						= Истина;
				КонецЕсли;
			КонецЕсли;	
		ИначеЕсли ОТ.Вид = "Договоры" Тогда
			Подразделение	= ПодразделениеСправочника(СсылкаНаОбъект);			
			Если ЗначениеЗаполнено(Подразделение) Тогда
				времРеквизиты	= ПолучитьРеквизитыШапки(Подразделение,"ЭтоГруппа,Код,ВидПодразделения","Справочник");
				Если НЕ ВремРеквизиты.ЭтоГруппа И 
					(
						времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
						ИЛИ времРеквизиты.ВидПодразделения=Перечисления.ВидыПодразделений.Торговое
					)	
					Тогда
					Результат.ВариантВыгрузки			= "Элемент";
					Результат.ПодразделениеПолучатель   = Подразделение;
					Результат.Нужно						= Истина;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ОТ.Вид = "Контрагенты"  Тогда
			ЭтоГруппа	= ПолучитьРеквизитШапки(СсылкаНаОбъект,"ЭтоГруппа","Справочник");
			Если ЭтоГруппа Тогда
				Результат.Нужно = Ложь;
			Иначе
				Если ФранчПодразделенияКонтрагента(СсылкаНаОбъект).Количество()>0 Тогда
					Результат.Нужно = Истина;									
					Результат.ВариантВыгрузки = "Документ.ЦеныПоставщика";
				КонецЕсли; 
			КонецЕсли; 
		ИначеЕсли ОТ.Вид = "ФизическиеЛица"  Тогда			
			рПроверки = НужноВыгружатьФЛ(СсылкаНаОбъект);
			Если рПроверки.Нужно Тогда 				
				Результат.Нужно 					= Истина;
				Результат.ВариантВыгрузки 			= "Элемент";
				Результат.ПодразделениеПолучатель   = рПроверки.ПодразделениеПолучатель;
			КонецЕсли;
		ИначеЕсли ОТ.Вид = "Договоры"  Тогда			
			рШапки	= ПолучитьРеквизитыШапки(СсылкаНаОбъект, "Владелец", "Справочник");
			Если ТипЗнч(рШапки.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				рПроверки = НужноВыгружатьФЛ(рШапки.Владелец);
				Если рПроверки.Нужно Тогда
					Результат.Нужно 					= Истина;
					Результат.ВариантВыгрузки 			= "Элемент";
					Результат.ПодразделениеПолучатель   = рПроверки.Подразделение;				
				КонецЕсли;
			КонецЕсли;	
		Иначе				
			ЭтоГруппа	= Ложь;
			Если ОТ.ИмеетГруппы Тогда
				ЭтоГруппа	= ПолучитьРеквизитШапки(СсылкаНаОбъект,"ЭтоГруппа","Справочник");					
			КонецЕсли;
			
			Результат.Нужно 	= Истина;
			Если ОТ.Вид="ТипыЦен" ИЛИ ОТ.Вид="ТипыСкидок" Тогда				
				Если ОТ.Вид="ТипыЦен" Тогда
					Результат.Нужно = ПолучитьРеквизитШапки(СсылкаНаОбъект,"Закупочный_ФР","Справочник");
				Иначе
					Результат.Нужно = Ложь;					
				КонецЕсли;
			Иначе
				//Результат.Ошибки.Добавить("Тип цен или тип скидок не являются розничными.");
			КонецЕсли; 
			
			Если Результат.Нужно = Истина Тогда
				Результат.ВариантВыгрузки	= ?(ЭтоГруппа,"Группа","Элемент");			
			КонецЕсли;
		КонецЕсли;
		
		
	ИначеЕсли ОТ.КлассЕЧ="ПланВидовХарактеристик" Тогда
		//Вручную - там один мусор
		//Нужно 		= Ложь;		
		
		ИменаРеквизитов	= "Наименование";
		Если ОТ.ИмеетГруппы Тогда			
			ИменаРеквизитов	= ИменаРеквизитов	+",ЭтоГруппа";
		КонецЕсли;		
		Реквизиты	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,ИменаРеквизитов,"ПланВидовХарактеристик");
		ЭтоГруппа	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(Реквизиты,"ЭтоГруппа",Ложь);
		
		Результат.ВариантВыгрузки	= ?(ЭтоГруппа,"Группа","Элемент");
		Если СтрНайти(Реквизиты.Наименование,"(ФР)")>0 Тогда
			Результат.Нужно	= Истина;
		Иначе
			Результат.Ошибки.Добавить("С этим мусосром непонятно что делать, пока грузится.");		
		КонецЕсли;		
	ИначеЕсли ОТ.КлассЕЧ="РегистрСведений" Тогда
		Результат.ВыгружаемаяСсылка	= ПолучитьСсылкуИзНЗ(СсылкаНаОбъект,ТипОбъекта);		
		Результат.ВариантВыгрузки	= ОТ.ПолноеИмя;
		Если ТипЗнч(Результат.ВыгружаемаяСсылка)=Тип("ДокументСсылка.ПрайсЛист") Тогда
			Розничный		= ПолучитьРеквизитШапки(Результат.ВыгружаемаяСсылка,"ТипЦен.Розничный","Документ");
			Если Розничный=Истина Тогда
				Результат.Нужно = Истина;
			Иначе				
				Результат.Ошибки.Добавить("Тип цен не является розничными.");			
			КонецЕсли;			
		ИначеЕсли ТипЗнч(Результат.ВыгружаемаяСсылка)=Тип("ДокументСсылка.УстановкаСкидок") Тогда			
			Розничный	= ПолучитьРеквизитШапки(Результат.ВыгружаемаяСсылка,"ТипСкидок.Розничный","Документ");
			Если Розничный=Истина Тогда
				Результат.Нужно = Истина;
			Иначе				
				Результат.Ошибки.Добавить("Тип скидок не является розничными.");			
			КонецЕсли;			
		ИначеЕсли ТипЗнч(СсылкаНаОбъект)=Тип("РегистрСведенийНаборЗаписей.РеквизитыСправочников") Тогда
			ТипВыгрСсылки=ТипЗнч(Результат.ВыгружаемаяСсылка);
			Если 				
				ТипВыгрСсылки=Тип("СправочникСсылка.ВнешниеОтчеты")
				ИЛИ ТипВыгрСсылки=Тип("СправочникСсылка.Договоры")
				ИЛИ ТипВыгрСсылки=Тип("СправочникСсылка.Пользователи")
				ИЛИ ТипВыгрСсылки=Тип("СправочникСсылка.ПунктыДоставки")
				ИЛИ ТипВыгрСсылки=Тип("СправочникСсылка.Контрагенты")
				ИЛИ ТипВыгрСсылки=Тип("СправочникСсылка.Номенклатура") 
				//+Служеб. 20241122 Михайловский ветка непонятная пока оставлю с добав.
				//эти лезут напрасно
				ИЛИ ТипВыгрСсылки=Тип("СправочникСсылка.ИнетМагазины")
				//-Служеб. 20241122 Михайловский ветка непонятная пока оставлю с добав.
				Тогда
				//Это не выгружается
			Иначе
				Результат.Нужно=Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СсылкаНаОбъект)=Тип("РегистрСведенийНаборЗаписей.История") Тогда
			Если СсылкаНаОбъект.Отбор.Реквизит.Значение="Декларация" Тогда
				Результат.Нужно=Истина;							
			КонецЕсли; 						
		ИначеЕсли ТипЗнч(СсылкаНаОбъект)=Тип("РегистрСведенийНаборЗаписей.КоличествоПосетителей") Тогда			
			Результат.Нужно=Истина;
		ИначеЕсли ТипЗнч(СсылкаНаОбъект)=Тип("РегистрСведенийНаборЗаписей.ЗначенияСвойствОбъектов") Тогда
			Если ТипЗнч(СсылкаНаОбъект.Отбор.Объект.Значение)=Тип("СправочникСсылка.Номенклатура") Тогда				
				Результат.Нужно=Истина;							
			КонецЕсли;
		ИначеЕсли ТипЗнч(СсылкаНаОбъект)=Тип("РегистрСведенийНаборЗаписей.КурсыВалют") Тогда
			Результат.Нужно=Истина;
		Иначе			
			Результат.Ошибки.Добавить("Объект типа: "+ОТ.ПолноеИмя+"не выгружается.");			
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НужноРегистрироватьОбъект(Знач СсылкаНаОбъект,ТипОбъекта=Неопределено) Экспорт

Функция НужноВыгружатьФЛ(ФЛ_Ссылка)
	Результат = Новый Структура("Нужно,ПодразделениеПолучатель", Ложь);
	рШапки	= ПолучитьРеквизитыШапки(ФЛ_Ссылка, 
		"ЭтоГруппа,Подразделение,Подразделение.КонтрагентФР,Подразделение.Закрыто,Подразделение.ВидПодразделения",
		"Справочник"
	);
	Если 
		рШапки.ЭтоГруппа = Ложь
		И рШапки.Подразделение_ВидПодразделения = Перечисления.ВидыПодразделений.Торговое
		И рШапки.Подразделение_Закрыто = Ложь
		И НЕ ЗначениеЗаполнено(рШапки.Подразделение_КонтрагентФР) Тогда
		
		Результат.Нужно 					= Истина;		
		Результат.ПодразделениеПолучатель   = рШапки.Подразделение;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ()


Функция НакладнаяГотоваКОтгрузкеИлиОтгружена(НакладнаяСсылка)
	Результат = Ложь;
	РеквизитыШ	= ПолучитьРеквизитыШапки(НакладнаяСсылка,"СостояниеНакладной,Проведен");
	Если РеквизитыШ.Проведен И 
		(РеквизитыШ.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке ИЛИ РеквизитыШ.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена) Тогда
		Результат = Истина;				
	КонецЕсли;	
	Возврат Результат;
КонецФункции //НакладнаяГотоваКОтгрузкеИлиОтгружена(НакладнаяСсылка)

Функция ФранчПодразделенияКонтрагента(Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.Подразделения
	|ГДЕ
	|	ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И КонтрагентФР = &Контрагент
	|	И НЕ ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции // ()
 

Функция ПолучитьРеквизитИзРегистра(Ссылка,ИмяРеквизита) Экспорт
	Запрос	= Новый Запрос;
	Запрос.Текст="	
	|ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников	
	|ГДЕ
	|	Справочник 		= &Ссылка
	|	И ИмяРеквизита	= """+ИмяРеквизита+"""	
	|";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗначениеРеквизита) Тогда
		Результат	= Выборка.ЗначениеРеквизита;
	Иначе
		Результат	= Неопределено;		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьРеквизитИзРегистра(Ссылка,ИмяРеквизита) 

Функция ПодразделениеСправочника(Ссылка)
	Если ЕстьРеквизитДокумента("Подразделение",Метаданные.НайтиПоТипу(ТипЗнч(Ссылка))) Тогда
		Результат	= ПолучитьРеквизитШапки(Ссылка,"Подразделение","Справочник");				
	Иначе
		Результат	= ПолучитьРеквизитИзРегистра(Ссылка,"Подразделение");				
	КонецЕсли;	
	
	ОТ	= Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	
	Возврат ОТ.ПривестиЗначение(Результат);	
КонецФункции //ПодразделениеСправочника(Ссылка)

Функция Это_ЗПК_На_ФР(СсылкаНаОбъект)
	
	РеквизитыШ	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"Подразделение,Подразделение.ВидПодразделения","Документ");
	
	Результат	= (РеквизитыШ.Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг);
	
	Возврат Новый Структура("Результат,ПодразделениеПолучатель",Результат,РеквизитыШ.Подразделение);	
	
КонецФункции //Это_ЗПК_На_ФР(СсылкаНаОбъект)

Функция Это_РКМ_На_ФР(СсылкаНаОбъект)
	Результат  = Ложь;
	
	Запрос	= Новый Запрос;
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ		
	|	Истина КАК Результат,
	|	Ссылка,
	|	ВидРекламации,
	|	ДокОснование,
	|	Проведен,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.РекламационнаяНакладная КАК Док_РКМ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ПО
	|	Док_РКМ.ПунктДоставки	= РеквизитыСправочников.Справочник
	|	И РеквизитыСправочников.ИмяРеквизита=""ПодразделениеФранчайзинга""
	|ГДЕ
	|	Ссылка = &СсылкаНаОбъект
	|	И ВЫРАЗИТЬ(РеквизитыСправочников.ЗначениеРеквизита КАК Справочник.Подразделения).ВидПодразделения=ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|";
	
	
	
	ПодразделениеПолучатель	= Неопределено;
	
	Результат = Новый Структура("Результат,ПодразделениеПолучатель,ВидРекламации,ДокОснование,Проведен",Ложь);
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Выборка	= Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //Это_РКМ_На_ФР(СсылкаНаОбъект)

Функция Это_РНК_На_ФР(СсылкаНаОбъект)
	Результат  = Ложь;
	
	Запрос	= Новый Запрос;
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ		
	|	Ссылка,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Док_РНК
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ПО
	|	Док_РНК.ПунктДоставки	= РеквизитыСправочников.Справочник
	|	И РеквизитыСправочников.ИмяРеквизита=""ПодразделениеФранчайзинга""
	|ГДЕ
	|	Ссылка = &СсылкаНаОбъект
	|	И ВЫРАЗИТЬ(РеквизитыСправочников.ЗначениеРеквизита КАК Справочник.Подразделения).ВидПодразделения=ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|";
	
	ПодразделениеПолучатель	= Неопределено;
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Выборка=Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат  				= Истина;	
		ПодразделениеПолучатель = Выборка.ПодразделениеПолучатель;
	КонецЕсли;
	
	Возврат Новый Структура("Результат,ПодразделениеПолучатель",Результат,ПодразделениеПолучатель);
КонецФункции //Это_РНК_На_ФР(СсылкаНаОбъект)

Функция Это_ПРМ_ПНК_На_ФР(СсылкаНаОбъект) Экспорт
	Результат	= Новый Структура("Результат,ПодразделениеПолучатель",Ложь,Справочники.Подразделения.ПустаяСсылка());
	РеквизитыШапки	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"
		|ДокОснование,
		|СкладПолучатель.Организация,
		|СкладПолучатель.Подразделение,
		|СкладПолучатель.Подразделение.ВидПодразделения,
		|Склад.Организация,
		|Склад.Подразделение.ВидПодразделения","Документ");
	Если 
		РеквизитыШапки.СкладПолучатель_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
		И ТипЗнч(РеквизитыШапки.ДокОснование)<>Тип("ДокументСсылка.РасходнаяНакладная")
		И (
			РеквизитыШапки.Склад_Подразделение_ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг
			ИЛИ РеквизитыШапки.Склад_Организация<>РеквизитыШапки.СкладПолучатель_Организация 
		)	
		Тогда
		
		Результат.Результат					= Истина;			
		Результат.ПодразделениеПолучатель   = РеквизитыШапки.СкладПолучатель_Подразделение;
		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //Это_ПРМ_ПНК_На_ФР(СсылкаНаОбъект)

Функция Это_ПРМ_ПРМ_На_ФР(СсылкаНаОбъект) Экспорт
	Результат	= Новый Структура("Результат,ПодразделениеПолучатель",Ложь,Справочники.Подразделения.ПустаяСсылка());
	РеквизитыШапки	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"
		|ДокОснование,
		|СкладПолучатель.Организация,
		|СкладПолучатель.Подразделение,
		|СкладПолучатель.Подразделение.ВидПодразделения,
		|Склад.Организация,
		|Склад.Подразделение.ВидПодразделения","Документ");
	Если 
		РеквизитыШапки.Склад_Организация=РеквизитыШапки.СкладПолучатель_Организация 
		И (						
			РеквизитыШапки.СкладПолучатель_Подразделение_ВидПодразделения	= Перечисления.ВидыПодразделений.Торговое		 
			ИЛИ (
				РеквизитыШапки.Склад_Подразделение_ВидПодразделения				= Перечисления.ВидыПодразделений.Франчайзинг
				И РеквизитыШапки.СкладПолучатель_Подразделение_ВидПодразделения	= Перечисления.ВидыПодразделений.Франчайзинг
				И ТипЗнч(РеквизитыШапки.ДокОснование)<>Тип("ДокументСсылка.РасходнаяНакладная")
			)
		) Тогда
		
		Результат.Результат					= Истина;			
		Результат.ПодразделениеПолучатель   = РеквизитыШапки.СкладПолучатель_Подразделение;
		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //Это_ПРМ_ПРМ_На_ФР(СсылкаНаОбъект)

Функция Это_ПРМ_ПРМ_С_ФР(СсылкаНаОбъект) Экспорт
	Результат	= Новый Структура("Результат,ПодразделениеПолучатель",Ложь,Справочники.Подразделения.ПустаяСсылка());
	РеквизитыШапки	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"
		|ДокОснование,
		|СкладПолучатель.Организация,
		|СкладПолучатель.Подразделение,
		|СкладПолучатель.Подразделение.ВидПодразделения,
		|Склад.Организация,
		|Склад.Подразделение.ВидПодразделения","Документ");
	Если 
		РеквизитыШапки.Склад_Организация=РеквизитыШапки.СкладПолучатель_Организация 
		И (		
			РеквизитыШапки.Склад_Подразделение_ВидПодразделения	= Перечисления.ВидыПодразделений.Торговое
			ИЛИ (
				РеквизитыШапки.Склад_Подразделение_ВидПодразделения				= Перечисления.ВидыПодразделений.Франчайзинг
				И РеквизитыШапки.СкладПолучатель_Подразделение_ВидПодразделения	= Перечисления.ВидыПодразделений.ПустаяСсылка() //Возврат на склад
				И ТипЗнч(РеквизитыШапки.ДокОснование)<>Тип("ДокументСсылка.РасходнаяНакладная")
			)
		) Тогда
		
		Результат.Результат					= Истина;			
		Результат.ПодразделениеПолучатель   = РеквизитыШапки.СкладПолучатель_Подразделение;
		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //Это_ПРМ_ПРМ_С_ФР(СсылкаНаОбъект)


Функция Это_ПРМ_РНК_С_ФР(СсылкаНаОбъект) Экспорт
	Результат	= Новый Структура("Результат,ПодразделениеПолучатель",Ложь,Справочники.Подразделения.ПустаяСсылка());
	РеквизитыШ	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"
		|ДокОснование,
		|Склад.Подразделение,
		|Склад.Организация,
		|Склад.Подразделение.ВидПодразделения,
		|СкладПолучатель.Организация,
		|СкладПолучатель.Подразделение,
		|СкладПолучатель.Подразделение.ВидПодразделения","Документ");
	
	Если РеквизитыШ.Склад_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
		И РеквизитыШ.СкладПолучатель_Подразделение_ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг
		Тогда
		
		Результат.Результат					= Истина;			
		Результат.ПодразделениеПолучатель   = РеквизитыШ.Склад_Подразделение;
	ИначеЕсли РеквизитыШ.Склад_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
		И РеквизитыШ.СкладПолучатель_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
		Если РеквизитыШ.Склад_Организация<>РеквизитыШ.СкладПолучатель_Организация Тогда
			Результат.Результат					= Истина;			
			Результат.ПодразделениеПолучатель   = РеквизитыШ.Склад_Подразделение;					
		КонецЕсли; 		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //Это_ПРМ_РНК_С_ФР(СсылкаНаОбъект)

Функция Это_ПНК_ВЗВ_На_ФР(СсылкаНаОбъект) Экспорт
	Результат	= Новый Структура("Результат,ПодразделениеПолучатель",Ложь,Справочники.Подразделения.ПустаяСсылка());
	РеквизитыШ	= ПолучитьРеквизитыШапки(СсылкаНаОбъект,"
		|КодОперации,
		|Склад.Подразделение,
		|Склад.Подразделение.ВидПодразделения","Документ");
	
	Если 
		РеквизитыШ.Склад_Подразделение_ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг
		И РеквизитыШ.КодОперации	= Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя 
		Тогда
		
		Результат.Результат					= Истина;			
		Результат.ПодразделениеПолучатель   = РеквизитыШ.Склад_Подразделение;
		
	КонецЕсли; 
	Возврат Результат;
КонецФункции //Это_ПНК_ВЗВ_На_ФР(СсылкаНаОбъект)

Функция ПолучитьСсылкуИзНЗ(НЗ,ТипОбъекта)
	
	СсылкаНаОбъект	= Неопределено;
	ПолеОтбора		= Неопределено;
	
	Если ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда
		ПолеОтбора	= "Прайс";
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.ЗначенияСвойствОбъектов") Тогда		
		ПолеОтбора	= "Объект";		
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.История") Тогда
		ПолеОтбора	= "Объект";		
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.КоличествоПосетителей") Тогда
		ПолеОтбора	= "Подразделение";		
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.КурсыВалют") Тогда
		ПолеОтбора	= "Валюта";
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.РеквизитыСправочников") Тогда
		ПолеОтбора	= "Справочник";		
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.СкидкиНоменклатуры") Тогда
		ПолеОтбора	= "Документ";
	ИначеЕсли ТипОбъекта=Тип("РегистрСведенийНаборЗаписей.СкидкиКонтрагентов") Тогда
		ПолеОтбора	= "Контрагент";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеОтбора) Тогда	
		СсылкаНаОбъект=НЗ.Отбор[ПолеОтбора].Значение;	
	КонецЕсли;	
	
	Возврат СсылкаНаОбъект;
	
КонецФункции //ПолучитьСсылкуИзНЗ(НЗ,ТипОбъекта)
 

Процедура ЗарегистрироватьОбъекты(ТабДокументов,ДопПараметры=Неопределено) Экспорт	
	ИД_Пакета				= Новый УникальныйИдентификатор();
	
	РегистрироватьДопОбъекты	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"РегистрироватьДопОбъекты",Ложь);
	
	МЗ	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьНаборЗаписей();			
	
	МЗ.ДополнительныеСвойства.Вставить("РегистрироватьДопОбъекты",РегистрироватьДопОбъекты);	
	
	МЗ.Отбор.ИД_Пакета.Установить(ИД_Пакета,Истина);
	
	Дубли		= Новый Соответствие;
	
	НачНомер	= ТекущаяУниверсальнаяДатаВМиллисекундах()*100000;
	
	Для Каждого СтрокаТД Из ТабДокументов Цикл
		Если СтрокаТД.ОбъектСсылка=Неопределено Тогда КонецЕсли; 
		ОбъектСсылка	= СтрокаТД.ОбъектСсылка;
		
		ТипСсылка	= ТипЗнч(ОбъектСсылка);
		ОбъектТип	= ФР_ОбщегоНазначения_ПИ.ИмяТипа(ЗначениеВСтрокуВнутр(ТипСсылка));
		Если ПустаяСтрока(ОбъектТип) Тогда Продолжить КонецЕсли; 
		
		ИД_Строки	= ОбъектТип+XMLСтрока(СтрокаТД.ОбъектСсылка)+СтрокаТД.ОтборРС_Хэш;
		Если Дубли.Получить(ИД_Строки)<>Неопределено Тогда Продолжить КонецЕсли; 
		Дубли.Вставить(ИД_Строки,Истина);
		
		Запись	= МЗ.Добавить();
		
		Запись.ОбъектТип		= ОбъектТип;
		Запись.ОбъектСсылкаУИД 	= ОбъектСсылка.УникальныйИдентификатор();
		Запись.ОтборРС_Хэш		= СтрокаТД.ОтборРС_Хэш;
		Запись.ИД_Пакета 		= ИД_Пакета;
		
		Запись.Получатель		= СтрокаТД.Получатель;
		Запись.ДокОснование		= СтрокаТД.ДокОснование;
		Запись.ОтборРС			= СтрокаТД.ОтборРС;
		
		Запись.ВариантВыгрузки	= ВариантВыгрузки(ОбъектСсылка,СтрокаТД.ВариантВыгрузки);
		Запись.Номер			= НачНомер;
		
		Запись.ДатаРегистрации	= ТекущаяДата();
		Запись.ПредставлениеОбъекта = ОбъектСсылка;
		
		НачНомер	= НачНомер+1;
	КонецЦикла;
	
	МЗ.Записать();
	
КонецПроцедуры

Функция ЭтоМодель_(Номенклатура)
	Результат	= Ложь;
	
	Запрос	= Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников
	|ГДЕ
	|	Справочник = &Справочник
	|	И ИмяРеквизита = ""ЭтоМодель""
	|";
	
	Запрос.УстановитьПараметр("Справочник",Номенклатура);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат	= Выборка.ЗначениеРеквизита;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()

Функция ЭтоМодель(Номенклатура)
	Возврат (ПолучитьРеквизитШапки(Номенклатура, "ЭтоМодель", "Справочник") = Истина);	
КонецФункции // ()

Функция ЗаписатьРеквизитСправочника(СпрСсылка,Имя,Значение)
	МЗ	= РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();	
	МЗ.Справочник			= СпрСсылка;
	МЗ.ИмяРеквизита			= Имя;
	МЗ.ЗначениеРеквизита    = Значение;
	
	МЗ.Записать();
КонецФункции //ЗаписатьРеквизитСправочника()
   

Функция ВариантВыгрузки(СсылкаНаОбъект,ВариантВыгрузки="") Экспорт	
	ТипОбъекта	= ТипЗнч(СсылкаНаОбъект);	
	
	Если ПустаяСтрока(ВариантВыгрузки) Тогда		
		ТипСтрВнутр	= ЗначениеВСтрокуВнутр(ТипОбъекта);
		ОТ			= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ТипСтрВнутр);
		
		Если ОТ.КлассЕЧ="Документ" Тогда
			Если ОТ.Вид="РасходнаяНакладная" Тогда
				ЭтоРНК	= Это_РНК_На_ФР(СсылкаНаОбъект);
				Если ЭтоРНК.Результат Тогда
					ВариантВыгрузки="РНК_ПНК";
				КонецЕсли;
			ИначеЕсли ОТ.Вид="Перемещение" Тогда
				текРезультат	= Это_ПРМ_ПНК_На_ФР(СсылкаНаОбъект);
				Если текРезультат.Результат Тогда
					ВариантВыгрузки="ПРМ_ПНК";
				Иначе
					текРезультат	= Это_ПРМ_РНК_С_ФР(СсылкаНаОбъект);
					Если текРезультат.Результат Тогда
						ВариантВыгрузки="ПРМ_РНК";
					Иначе
						ВариантВыгрузки="ПРМ_ПРМ";						
					КонецЕсли;				
				КонецЕсли;			
			ИначеЕсли ОТ.Вид="ПриходнаяНакладная" Тогда
				текРезультат	= Это_ПНК_ВЗВ_На_ФР(СсылкаНаОбъект);
				Если текРезультат.Результат Тогда
					ВариантВыгрузки="ПНК_ВЗВ";														
				КонецЕсли; 				
			ИначеЕсли ОТ.Вид="ЭмиссияПодарочныхСертификатов" Тогда
				РеквизитыШ = ПолучитьРеквизитыШапки(СсылкаНаОбъект,"КодОперации,Подразделение","Документ");
				Если 
					РеквизитыШ.КодОперации = Перечисления.КодыОперацийПС.Деактивация
					ИЛИ РеквизитыШ.КодОперации = Перечисления.КодыОперацийПС.Дарение Тогда
					
					ВариантВыгрузки			= "ЭПС_СПН";				
				КонецЕсли;
			КонецЕсли;			
		ИначеЕсли ОТ.КлассЕЧ="Справочник" Тогда			
			ВариантВыгрузки = "Элемент";
			Если ОТ.Вид	="Номенклатура" Тогда		
				Реквизиты = ПолучитьРеквизитыШапки(СсылкаНаОбъект,"ЭтоГруппа,Родитель"); 
				
				Если Реквизиты.ЭтоГруппа=Null ИЛИ Реквизиты.ЭтоГруппа = Неопределено Тогда
					Возврат "";									
				КонецЕсли; 
				
				Если Реквизиты.ЭтоГруппа Тогда
					//а с группами вообще непонятно что.......	
					ВариантВыгрузки = ВариантВыгрузкиГруппаНоменклатуры(СсылкаНаОбъект);
				Иначе					
					Если ЭтоМодель(Реквизиты.Родитель) = Истина Тогда
						ЗарегистрироватьОбъект(Реквизиты.Родитель);											
					КонецЕсли; 					
					ВариантВыгрузки	= "Справочник.ХарактеристикиНоменклатуры";					
				КонецЕсли;
			Иначе				
				Если ОТ.ИмеетГруппы Тогда
					ЭтоГруппа	= ПолучитьРеквизитШапки(СсылкаНаОбъект,"ЭтоГруппа","Справочник");
					Если ЭтоГруппа Тогда
						ВариантВыгрузки = "Группа";					
					КонецЕсли;					
				КонецЕсли; 
			КонецЕсли;
		ИначеЕсли ОТ.КлассЕЧ="ПланВидовХарактеристик" Тогда
			Результат = "Элемент";
			Если ОТ.ИмеетГруппы Тогда				
				ЭтоГруппа	= ПолучитьРеквизитШапки(СсылкаНаОбъект,"ЭтоГруппа","ПланВидовХарактеристик");
				Если ЭтоГруппа Тогда
					ВариантВыгрузки = "Группа";					
				КонецЕсли; 				
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВариантВыгрузки;

КонецФункции //ВариантРегистрации(СсылкаНаОбъект)

Функция ВариантВыгрузкиГруппаНоменклатуры(Номенклатура)	
	ВариантВыгрузки = -1;	
	ЭтоМодель 		= ЭтоМодель(Номенклатура);	
	
	Если ЭтоМодель Тогда
		ВариантВыгрузки = "Элемент";
	Иначе
		КолПодчОбъектов = ПодчиненыеОбъекты(Номенклатура);
		
		Если КолПодчОбъектов.Группы = 0 Тогда
			Если КолПодчОбъектов.Элементы > 0 Тогда //Модель			
				ВариантВыгрузки = "Элемент";
			Иначе
				//Пустая группа - ХЗ что это
			КонецЕсли; 
		Иначе
			Если КолПодчОбъектов.Элементы = 0 Тогда //Группа
				ВариантВыгрузки = "Группа";					
			Иначе							
				//Это каша
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ВариантВыгрузки;
КонецФункции //ВариантВыгрузкиГруппаНоменклатуры(Номенклатура)
 

Функция СделатьЗаписьРегистрации(ОбъектСсылка,ВариантВыгрузки="",ОтборРС="",ПодразделениеПолучатель=Неопределено) Экспорт
	Результат	= Новый Структура("Результат,Ошибки",Ложь,Новый Массив);
	
	ТекстОшибки	= "";
	Если ВариантВыгрузки =-1 Тогда 
		ТекстОшибки	= "Не определен вариант выгрузки.";		
	ИначеЕсли НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		ТекстОшибки	= "Пустой объект выгрузки.";		
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Результат.Ошибки.Добавить(ТекстОшибки);	
		Возврат Результат;		
	КонецЕсли; 
	
	Запись	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьМенеджерЗаписи();
	
	Если ЗначениеЗаполнено(ОтборРС) Тогда
		ОтборРС_Хэш	= ФР_ОбщегоНазначения_С.ХэшСтрока(ОтборРС);
	Иначе
		ОтборРС_Хэш	= "";		
	КонецЕсли; 
	
	ОбъектСсылкаУИД	= ОбъектСсылка.УникальныйИдентификатор();
	
	//Если НЕ ЗаписьСуществует(ОбъектСсылкаУИД,ОтборРС_Хэш,ВариантВыгрузки) Тогда		
		Запись.ОбъектТип		= ФР_ОбщегоНазначения_ПИ.ИмяТипа(ЗначениеВСтрокуВнутр(ТипЗнч(ОбъектСсылка)));
		Запись.ОбъектСсылкаУИД	= ОбъектСсылкаУИД;
		Запись.ОтборРС_Хэш		= ОтборРС_Хэш;
		Запись.ИД_Пакета		= Новый УникальныйИдентификатор();		
		
		Запись.Номер			= ТекущаяУниверсальнаяДатаВМиллисекундах()*100000;
		
		Запись.ВариантВыгрузки	= ВариантВыгрузки;		
		
		Если ЗначениеЗаполнено(ОтборРС) Тогда
			Запись.ОтборРС		= Новый ХранилищеЗначения(ОтборРС,Новый СжатиеДанных(1));
		КонецЕсли;		
		
		Запись.Получатель		= ПодразделениеПолучатель;		
		Запись.ДатаРегистрации	= ТекущаяДата();
		Запись.ПредставлениеОбъекта	= ОбъектСсылка;	
		
		Если Запись.ОбъектСсылкаУИД<>Неопределено Тогда
			Запись.Записать();
			Результат.Результат	= Истина;
		КонецЕсли;
	//КонецЕсли;
	
	Если (ТипЗнч(ОбъектСсылка)=Тип("ДокументСсылка.РасходнаяНакладная")	ИЛИ ТипЗнч(ОбъектСсылка)=Тип("ДокументСсылка.Перемещение"))
		И (ВариантВыгрузки="ПРМ_ПНК" ИЛИ  ВариантВыгрузки="РНК_ПНК") Тогда
		
		СостояниеНакладной = ПолучитьРеквизитШапки(ОбъектСсылка,"СостояниеНакладной","Документ");
		
		Если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке ИЛИ СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда			
			Зарегистрировать_ШКиДекларацииПоПНК(ОбъектСсылка);			
		КонецЕсли;	    
	ИначеЕсли ТипЗнч(ОбъектСсылка)=Тип("ДокументСсылка.ПрайсЛист") Тогда
		Если ПустаяСтрока(ВариантВыгрузки) Тогда
			ЗарегистрироватьЦены(ОбъектСсылка);
		КонецЕсли;		
	ИначеЕсли ТипЗнч(ОбъектСсылка)=Тип("ДокументСсылка.УстановкаСкидок") Тогда
		Если ПустаяСтрока(ВариантВыгрузки) Тогда
			ЗарегистрироватьСкидки(ОбъектСсылка);		
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ОбъектСсылка)=Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
		ЗарегистрироватьКМпоХКМ(ОбъектСсылка);				
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

Функция ЗаписьСуществует(ОбъектСсылкаУИД,ОтборРС_Хэш,ВариантВыгрузки)
	Результат	= Ложь;
	
	Запрос	=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектСсылкаУИД
	|ИЗ 
	|	РегистрСведений.ФР_ОбъектыКВыгрузке	
	|ГДЕ
	|	ОбъектСсылкаУИД	= &ОбъектСсылкаУИД
	|	И ОтборРС_Хэш	= &ОтборРС_Хэш 
	|	И ВариантВыгрузки = &ВариантВыгрузки
	|";
	
	Запрос.УстановитьПараметр("ОбъектСсылкаУИД",	ОбъектСсылкаУИД);
	Запрос.УстановитьПараметр("ОтборРС_Хэш",		ОтборРС_Хэш);
	Запрос.УстановитьПараметр("ВариантВыгрузки",	ВариантВыгрузки);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ОбъектСсылкаУИД) Тогда
		Результат=Истина;			
	КонецЕсли; 
	
	Возврат Результат;	 	
КонецФункции //ЗаписьСуществует(СсылкаНаОбъект,ОтборРС)
 

Функция ПодчиненыеОбъекты(Группа)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР КОГДА ЭтоГруппа ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Группы,
	|	СУММА(ВЫБОР КОГДА ЭтоГруппа ТОГДА 0 ИНАЧЕ 1 КОНЕЦ) КАК Элементы
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Родитель=&Группа
	|";
	
	
	Результат = Новый Структура("Группы,Элементы",0,0);
	
	Запрос.УстановитьПараметр("Группа",	Группа);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Группы<>Null Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПодчиненыеОбъекты(Группа)

Процедура УдалитьРегистрацию(ОбъектТип,ОбъектСсылкаУИД,ОтборРС_Хэш,ВариантВыгрузки) Экспорт	
	НЗ	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьНаборЗаписей();	
	
	НЗ.Отбор.ОбъектТип.Установить(ОбъектТип,Истина);
	НЗ.Отбор.ОбъектСсылкаУИД.Установить(ОбъектСсылкаУИД,Истина);
	НЗ.Отбор.ОтборРС_Хэш.Установить(ОтборРС_Хэш,Истина);
	НЗ.Отбор.ВариантВыгрузки.Установить(ВариантВыгрузки,Истина);
	
	ИспользоватьУправляемыеБлокировки=Ложь;
	Если ИспользоватьУправляемыеБлокировки Тогда
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ФР_ОбъектыКВыгрузке");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("ОбъектТип", 		ОбъектТип);
		ЭлементБлокировки.УстановитьЗначение("ОбъектСсылкаУИД", ОбъектСсылкаУИД);
		ЭлементБлокировки.УстановитьЗначение("ОтборРС_Хэш", 	ОтборРС_Хэш);
		ЭлементБлокировки.УстановитьЗначение("ВариантВыгрузки", ВариантВыгрузки);
		
		БлокировкаДанных.Заблокировать();	
	КонецЕсли;	
	
	НЗ.Записать();	
КонецПроцедуры

Функция ИзмененияЗарегистрированы(СсылкаНаОбъект,ОтборРС) Экспорт
	Результат	= Ложь;
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.ФР_ОбъектыКВыгрузке	
	|ГДЕ	
	|	СсылкаНаОбъект=&СсылкаНаОбъект
	|	И (ОтборРС=&ОтборРС ИЛИ &БезОтбораПоРС)
	|";
	
	МаксНомер	= 0;
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект",	СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ОтборРС",		ОтборРС);
	Запрос.УстановитьПараметр("БезОтбораПоРС",	НЕ ЗначениеЗаполнено(ОтборРС));	
	
	Выборка		= Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.СсылкаНаОбъект) Тогда
		Результат=Истина;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ИзмененияЗарегистрированы(УзелПолучатель,Ссылка) Экспорт

Функция СоздатьТаблицуОбъектов() Экспорт
	ТД	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьНаборЗаписей().ВыгрузитьКолонки("ОбъектТип,ВариантВыгрузки,Получатель,ДокОснование,ОтборРС,ОтборРС_Хэш,ИмяТаблицы");
	ТД.Колонки.Добавить("ОбъектСсылка",ФР_ОбщегоНазначения_С.Тип_ВсеСсылки());
	
	Возврат ТД;
КонецФункции //СоздатьТаблицуОбъектовКРегистрации()

Функция ЗарегистрироватьКМпоХКМ(ДокСсылка, ДопПараметры = Неопределено)	
	Результат		= Новый Структура("Ошибки,Сообщения",Новый Массив,Новый Массив);
			
	Запрос			= Новый Запрос;	
	Запрос.Текст	= "	
	|ВЫБРАТЬ 	
	|	ШтрихкодУпаковки 			КАК КМ_Ссылка,
	|	ШтрихкодУпаковки.ТипКода    КАК ТипКода
	|ПОМЕСТИТЬ ВТ_ШК
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок	
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|;
	|ВЫБРАТЬ
	|	КМ_Ссылка КАК ОбъектСсылка	
	|ИЗ
	|	ВТ_ШК
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ШтрихКод
	|ИЗ	
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды
	|ГДЕ
	|	Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ КМ_Ссылка ИЗ ВТ_ШК ГДЕ ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка))
	|";	
		
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();	
	
	Выборка		= Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		СтрокаТО	= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка		= Выборка.ОбъектСсылка;		
		СтрокаТО.ВариантВыгрузки	= "Элемент";
	КонецЦикла; 
			
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО, ДопПараметры);	
	
	Результат.Сообщения.Добавить(СтрШаблон("Выгружено: %1 кодов маркировки.",	Выборка.Количество()));	
	
	Возврат Результат;
КонецФункции //ЗарегистрироватьКМпоХКМ(МассивСсылок, ДопПараметры = Неопределено) Экспорт

Функция ЗарегистрироватьЦены(ДокСсылка) Экспорт
	ДанныеРегистрации	= НужноРегистрироватьОбъект(ДокСсылка);
	Если ДанныеРегистрации.Нужно Тогда		
		ТипЦен	= ПолучитьРеквизитШапки(ДокСсылка,"ТипЦен");
		
		НЗ			= РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		НЗ.Отбор.Прайс.Установить(ДокСсылка,Истина);
		НЗ.Отбор.ТипЦен.Установить(ТипЦен,Истина);		
		
		ЗарегистрироватьОбъект(НЗ);
	КонецЕсли;	
	Возврат ДанныеРегистрации;
КонецФункции //ЗарегистрироватьЦены()
 
Функция ЗарегистрироватьСкидки(ДокСсылка) Экспорт
	ДанныеРегистрации	= НужноРегистрироватьОбъект(ДокСсылка);
	Если ДанныеРегистрации.Нужно Тогда	
		ТипСкидок	= ПолучитьРеквизитШапки(ДокСсылка,"ТипСкидок");
		
		НЗ			= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(ДокСсылка,Истина);
		НЗ.Отбор.ТипСкидок.Установить(ТипСкидок,Истина);
		
		ЗарегистрироватьОбъект(НЗ);
	КонецЕсли;
КонецФункции //ЗарегистрироватьСкидки()

Функция ПолучитьЗапросПоПНК(ДокСсылка)
	ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(ДокСсылка)));
	
	Запрос			= Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст	= "	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Номенклатура,
	|	Номенклатура.Родитель	КАК Модель,
	|	Номенклатура.Цвет 		КАК Цвет,
	|	Номенклатура.Размер 	КАК Размер
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ 
	|	"+ОТ.ПолноеИмя+".Товары
	|ГДЕ 			
	|	Ссылка=&ДокСсылка
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка",ДокСсылка);
	Запрос.Выполнить();
	
	Возврат Запрос;	
КонецФункции // ()
 

Функция Зарегистрировать_ШКиДекларацииПоПНК(ДокСсылка) Экспорт
	Запрос = ПолучитьЗапросПоПНК(ДокСсылка);	
	Запрос.Текст	= "
	|ВЫБРАТЬ 	
	|	История.Объект			КАК Объект,
	|	История.Реквизит		КАК Реквизит,
	|	История.Значение		КАК Значение,
	|	История.Документ		КАК Документ,
	|	ПоследниеПериоды.Период	КАК Период	
	|ИЗ
	|	РегистрСведений.История	КАК История
	|ПРАВОЕ СОЕДИНЕНИЕ	
	|(
	|ВЫБРАТЬ
	|	Объект 				КАК Номенклатура,
	|	Реквизит			КАК Реквизит,
	|	МАКСИМУМ(Период)	КАК Период
	|ИЗ
	|	РегистрСведений.История
	|ГДЕ 	
	|	Объект ССЫЛКА Справочник.Номенклатура
	|	И Реквизит = ""Декларация""
	|	И НЕ ВЫРАЗИТЬ(Объект КАК Справочник.Номенклатура).ВерсияДанных ЕСТЬ NULL
	|	И Объект В (ВЫБРАТЬ РАЗЛИЧНЫЕ Модель ИЗ ВТ_Номенклатура)
	|СГРУППИРОВАТЬ ПО
	|	Объект,
	|	Реквизит
	|) КАК ПоследниеПериоды
	|ПО
	|	История.Период = ПоследниеПериоды.Период
	|	И История.Объект ССЫЛКА Справочник.Номенклатура
	|	И История.Объект	= ПоследниеПериоды.Номенклатура
	|	И История.Реквизит	= ПоследниеПериоды.Реквизит	
	|УПОРЯДОЧИТЬ ПО Объект
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка",ДокСсылка);
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		НЗ	= РегистрыСведений.История.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Период.Установить(Выборка.Период,Истина);	
		НЗ.Отбор.Объект.Установить(Выборка.Объект,Истина);
		НЗ.Отбор.Реквизит.Установить(Выборка.Реквизит,Истина);
		НЗ.Отбор.Документ.Установить(Выборка.Документ,Истина);
		
		СтрокаТО	= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка		= Выборка.Объект;		
		СтрокаТО.ВариантВыгрузки	= "РегистрСведений.История";
		СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
		СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);	
		
		СтрокаТО	= ТО.Добавить();		
		СтрокаТО.ОбъектСсылка		= Выборка.Значение;		
	КонецЦикла; 
	
	Результат	= Новый Структура("КоличествоДеклараций,КоличествоШК",0,0);
	
	ЗарегистрироватьОбъекты(ТО);	
	
	Результат.КоличествоДеклараций	= ТО.Количество();
	
	Запрос.Текст="	
	|ВЫБРАТЬ
	|	Ссылка
  	|ИЗ
	|	Справочник.ШтрихКоды	
	|ГДЕ
	|	НЕ Наименование ПОДОБНО ""99999%""		
	|	И Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ ВТ_Номенклатура)	
	|УПОРЯДОЧИТЬ ПО 	
	|	Наименование
	|";
	
	Результат.КоличествоШК	= ЗарегистрироватьВыборку(Запрос,"Справочник.ШтрихКоды","Элемент");	
	
	Возврат Результат;
КонецФункции

Функция Зарегистрировать_НоменклатуруПоПНК(ДокСсылка) Экспорт
	Результат	= Новый Структура("КоличествоМоделей,КоличествоХарактеристик,КоличествоЦветов,КоличествоРазмеров",0,0,0,0);
	
	Запрос = ПолучитьЗапросПоПНК(ДокСсылка);	
	Запрос.УстановитьПараметр("ДокСсылка",ДокСсылка);
	
	Запрос.Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ Модель КАК Ссылка ИЗ ВТ_Номенклатура УПОРЯДОЧИТЬ ПО Модель.Наименование";
	Результат.КоличествоМоделей	= ЗарегистрироватьВыборку(Запрос,"Справочник.Номенклатура","Элемент");	
			
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура КАК Ссылка ИЗ ВТ_Номенклатура	УПОРЯДОЧИТЬ ПО Номенклатура.Наименование";	
	Результат.КоличествоХарактеристик	= ЗарегистрироватьВыборку(Запрос,"Справочник.Номенклатура","Справочник.ХарактеристикиНоменклатуры");
	
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ Цвет КАК Ссылка ИЗ ВТ_Номенклатура	УПОРЯДОЧИТЬ ПО Цвет.Наименование ";	
	Результат.КоличествоЦветов	= ЗарегистрироватьВыборку(Запрос,"Справочник.Цвета","Элемент");
	
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ Размер КАК Ссылка ИЗ ВТ_Номенклатура	УПОРЯДОЧИТЬ ПО Цвет.Наименование ";	
	Результат.КоличествоРазмеров	= ЗарегистрироватьВыборку(Запрос,"Справочник.Размеры","Элемент");
	
	Возврат Результат;
КонецФункции //Зарегистрировать_НоменклатуруПоПНК(ДокСсылка)

Функция ЗарегистрироватьВыборку(Запрос,ИмяОбъекта,ВариантВыгрузки="",ДопПараметры=Неопределено) Экспорт	
	Если ДопПараметры<>Неопределено Тогда
		Для Каждого Элемент Из ДопПараметры Цикл
			Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);		
		КонецЦикла; 	
	КонецЕсли; 
	
	ТО			= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	
	//Сообщить_("К регистрации по типу "+ИмяОбъекта+" найдено: "+Выборка.Количество()+" объектов.");
	Пропущено=0;
	
	Пока Выборка.Следующий() Цикл
		ОбработкаПрерыванияПользователя_(); 	
		
		Результат	= РегистрыСведений.ФР_ОбъектыКВыгрузке.НужноРегистрироватьОбъект(Выборка.Ссылка);
		Если Результат.Нужно Тогда			
			СтрокаТО	= ТО.Добавить();
			
			СтрокаТО.ОбъектСсылка		= Результат.ВыгружаемаяСсылка;		
			СтрокаТО.ВариантВыгрузки	= ?(ПустаяСтрока(ВариантВыгрузки), Результат.ВариантВыгрузки, ВариантВыгрузки);
			СтрокаТО.Получатель			= Результат.ПодразделениеПолучатель;			
			
			Если ИмяОбъекта="Документ.ПрайсЛист" Тогда
				НЗ			= РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
				НЗ.Отбор.Прайс.Установить(Выборка.Ссылка,Истина);
				НЗ.Отбор.ТипЦен.Установить(Выборка.ТипЦен,Истина);
				
				СтрокаТО	= ТО.Добавить();
				
				СтрокаТО.ОбъектСсылка		= Выборка.Ссылка;		
				СтрокаТО.ВариантВыгрузки	= "РегистрСведений.ЦеныНоменклатуры";
				СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
				СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);
			ИначеЕсли ИмяОбъекта="Документ.УстановкаСкидок" Тогда			
				НЗ			= РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
				НЗ.Отбор.Документ.Установить(Выборка.Ссылка,Истина);
				НЗ.Отбор.ТипСкидок.Установить(Выборка.ТипСкидок,Истина);
				
				СтрокаТО	= ТО.Добавить();
				
				СтрокаТО.ОбъектСсылка		= Выборка.Ссылка;		
				СтрокаТО.ВариантВыгрузки	= "РегистрСведений.СкидкиНоменклатуры";
				СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
				СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);
			КонецЕсли; 
		Иначе
			Пропущено=Пропущено+1;
		КонецЕсли;
		
		Если ТО.Количество()>=1000 Тогда
			РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);
			ТО.Очистить();		
		КонецЕсли; 	
		
		Сч=Сч+1;
		Если Сч%100=0 Тогда
			Состояние_("Регистрация "+ИмяОбъекта+": "+(ВсегоСтрок-Сч));		
		КонецЕсли;		
	КонецЦикла; 
	
	Если ТО.Количество()>0 Тогда
		РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);
	КонецЕсли; 
	
	//Сообщить_("	зарегистрировано: "+ТО.Количество()+", пропущено: "+Пропущено);
	
	Состояние_("");

	Возврат ТО.Количество();
КонецФункции

Функция Зарегистрировать_СвойстваНоменклатуры(МассивСсылок) Экспорт	
	Запрос			= Новый Запрос;	
	Запрос.Текст	= "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Объект КАК Ссылка
	|ИЗ 
	|	РегистрСведений.ЗначенияСвойствОбъектов 
	|ГДЕ 
	|	Объект В (&МассивСсылок) 
	|	И Свойство В (&Свойсво_Бренд,&Свойсво_ВидНоменклатуры)
	|";
	
	Запрос.УстановитьПараметр("МассивСсылок",			МассивСсылок);
	Запрос.УстановитьПараметр("Свойсво_Бренд",			ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Бренд (ФР)"));
	Запрос.УстановитьПараметр("Свойсво_ВидНоменклатуры",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Вид номенклатуры (ФР)"));
	
	ТО	= РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьТаблицуОбъектов();
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработкаПрерыванияПользователя_();
		
		НЗ	= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НЗ.Отбор.Объект.Установить(Выборка.Ссылка,Истина);
		
		СтрокаТО 				= ТО.Добавить();
		
		СтрокаТО.ОбъектСсылка	= Выборка.Ссылка;		
		СтрокаТО.ВариантВыгрузки= "РегистрСведений.ЗначенияСвойствОбъектов"; 		
		
		СтрокаТО.ОтборРС			= Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Отбор));		
		СтрокаТО.ОтборРС_Хэш		= ФР_ОбщегоНазначения_С.ХэшСтрока(СтрокаТО.ОтборРС);	
	КонецЦикла; 
	
	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъекты(ТО);	
	Возврат ТО.Количество();
КонецФункции

Функция Сообщить_(ТекстСообщения,Статус=Неопределено)
	#ЕСЛИ КЛИЕНТ ТОГДА
		Сообщить(ТекстСообщения,Статус);
	#КОНЕЦЕСЛИ
КонецФункции //Сообщить_(ТекстСообщения,Статус=Неопределено)

Функция Состояние_(Строка)
	#ЕСЛИ КЛИЕНТ ИЛИ ТолстыйКлиентОбычноеПриложение ТОГДА
		Состояние(Строка);
	#КОНЕЦЕСЛИ
КонецФункции

Процедура ОбработкаПрерыванияПользователя_()
	#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
	#КОНЕЦЕСЛИ
КонецПроцедуры

Функция НужноРегистрироватьХКМ_ДляФР(СсылкаНаОбъект)
	Результат	= Новый Структура(
		"ВариантВыгрузки,ВыгружаемаяСсылка,ПодразделениеПолучатель,Нужно,Ошибки",
		"", СсылкаНаОбъект, Неопределено, Ложь, Новый Массив);
	
	Если НЕ Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Возврат Результат;
	КонецЕсли;
	
	РеквизитыШ = ПолучитьРеквизитыШапки(СсылкаНаОбъект, "ДокОснование,КодУзлаСоздания");
	
	Если ТипЗнч(РеквизитыШ.ДокОснование) = Тип("ДокументСсылка.Перемещение") Тогда
		ДокОснование 	= РеквизитыШ.ДокОснование;
		
		текРезультат	= Это_ПРМ_ПРМ_На_ФР(ДокОснование);
		Если текРезультат.Результат Тогда			
			Результат.Нужно			  			= Истина;				
			
			Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
		Иначе
			//крохин начало 24.12.2024
			//СсылкаНаОбъект - ХКМ, при передаче его в функцию Это_ПРМ_ПРМ_С_ФР выходит ошибка "нет реквизита подразделение".
			//текРезультат	= Это_ПРМ_ПРМ_С_ФР(СсылкаНаОбъект);			
			//
			//Результат.Нужно	= Истина;				
			//
			//Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;							
			//крохин конец 24.12.2024
		КонецЕсли;
		ИначеЕсли ТипЗнч(РеквизитыШ.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ДокОснование 	= РеквизитыШ.ДокОснование;
		
		текРезультат	= Это_РНК_На_ФР(ДокОснование);
		Если текРезультат.Результат Тогда			
			Результат.Нужно			  			= Истина;				
			
			Результат.ПодразделениеПолучатель	= текРезультат.ПодразделениеПолучатель;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //НужноРегистрироватьХКМ_ДляФР()

//+HELP-2306 20250220 Михайловский	
Функция НужноРегистрироватьПСАЗ(СсылкаНаОбъект)
	Результат	= Новый Структура(
		"ВариантВыгрузки,ВыгружаемаяСсылка,ПодразделениеПолучатель,Нужно,Ошибки",
		"", СсылкаНаОбъект, СсылкаНаОбъект.Подразделение, Ложь, Новый Массив);
	Если СсылкаНаОбъект.Состояние = Перечисления.СостоянияЗаявкиНаСторонПост.Отменена ИЛИ
	СсылкаНаОбъект.Состояние = Перечисления.СостоянияЗаявкиНаСторонПост.Выполнена ИЛИ
	СсылкаНаОбъект.Состояние = Перечисления.СостоянияЗаявкиНаСторонПост.Согласована Тогда
		Результат.Нужно = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции //-HELP-2306 20250220 Михайловский
